{"condition_names":{"0":"boils","1":"cellulitis","2":"chilblains","3":"frostbite","4":"impetigo-school-sores","5":"leg-ulcers","6":"pityriasis-rosea","7":"melanoma","8":"eczema-atopic-dermatitis","9":"mccune-albright-syndrome","10":"psoriasis","11":"sunburn","12":"bedbugs","13":"body-lice","14":"fleas","15":"hives","16":"blisters","17":"cold-sores","18":"tinea","19":"warts","20":"blushing-and-flushing","21":"erythema-nodosum","22":"leprosy","23":"rosacea","24":"scleroderma"},"symptom_lists":{"0":["A small area of skin becomes inflamed and tender","A painful lump appears","After a few days, a white or yellow head forms","The boil bursts","The pus drains out","The site heals","A scar may form, depending on the severity of the boil."],"1":["redness of the skin","warmth","swelling","tenderness or pain in an area of skin","weeping or leaking of yellow clear fluid or pus."],"2":["a burning sensation on the skin","red, blue, purple or white swollen patches","mild to intense itching","dry skin, leading to splits and cracks","possible secondary infection","ulceration, in severe cases."],"3":["cold, white and hard skin","pain","itching","loss of feeling in the affected area","mottled skin","swelling and blistering","the skin becomes red and blotchy when warmed","tissue loss, depending on the severity of the frostbite."],"4":["fever","swollen lymph glands","general feeling of unwellness (malaise)."],"5":["that they are commonly found on the lower leg and ankle","a sunken, asymmetrically shaped wound","the edges of the ulcer are clearly defined from the surrounding skin","the surrounding skin is intact, but inflamed","the surrounding skin may be pigmented, hardened or calloused","yellowish-white exudate (pus)","pain, particularly while standing","varicose veins in the leg."],"6":["A large single spot (herald patch) forms.","The herald patch is scaled and coloured red to tan.","A fine rash of small spots starts to appear within a week of the first patch appearing.","The spots become small oval patches that are coloured red to tan.","The patches seem crinkly and loose in the centre.","The rash may be itchy.","The upper body and upper arms are usually affected.","The patches may follow the ribs in lines.","The rash may spread to the upper thighs.","Occasionally, the rash may spread to include the neck and lower face."],"7":["The spot may grow larger.","The edges of the spot may look irregular, rather than smooth.","The spot may be mottled with a range of colours such as brown, black, blue, red, white or light grey.","The spot may be itchy or bleed."],"8":["skin dryness","red and scaly areas on the front of the elbows and the back of the knees","watery fluid weeping from affected skin","itchiness","lesions (sores) that may become infected by bacteria or viruses."],"9":["polyostotic fibrous dysplasia – the abnormal growth of two or more bones. Bones of the face, skull, arms and legs are commonly affected","café au lait birthmarks, usually on the abdomen or back – these birthmarks are flat, oval-shaped spots with a jagged outline. Café au lait birthmarks are often the first signs of the condition and appear at or shortly after birth. They are light brown (or 'milk-coffee coloured') in people with lighter skin. In people with darker skin they may be harder to see","premature sexual maturity – this can affect girls and boys, but is much more common in girls ","onset of the menstrual period before the growth of breasts or pubic hair","ovarian cysts, which are thought to trigger early menstruation","symptoms of an overactive thyroid gland (hyperthyroidism)."],"10":["red scaly patches on scalp, elbows, knees and other parts of the body","itchiness – however, many people do not feel itchy at all","shedding of scales of skin."],"11":["changes in skin colour, ranging from pink to red and even purple","skin that feels hot to the touch","pain and\/or itching","swelling","fluid-filled blisters that may itch and eventually pop or break","broken blisters that peel to reveal even more tender skin beneath."],"12":["large weals that reduce to a red mark, then gradually fade over a few days","itchiness","reddening of the skin","localised swelling","formation of blisters","small loss of skin tissue in some cases."],"13":["The red dot rises into a small cyst-like lump or papule.","The area becomes inflamed.","The bite causes irritation and severe itching.","Secondary infection can result from continuous scratching."],"14":["It is extremely itchy.","A red, swollen weal develops within half an hour of the bite.","After a day or so, the weal (lump) may develop into a blister or small wound.","The legs and feet are often targeted.","Secondary infections caused by scratching are common.","Some people may become hypersensitive (very sensitive) to bites."],"15":["raised circular wheals that look like mosquito bites – these are red on the outer rim and white in the centre, and each wheal lasts for around 2 to 4 hours (rarely up to 24 hours). Wheals appear in batches or clusters, and as one batch fades away a new batch appears","localised itching","with acute urticaria, the rash may last for days or weeks","with chronic hives, the rash may persist for months to years, occasionally decades."],"16":["a reddened and tender patch of skin","a raised lump filled with clear fluid or, sometimes, blood."],"17":["fever","headache","malaise ","muscle aches","blisters (lesions) and ulcers in and around the mouth ","pain and swelling inside the mouth and on the gums","a sore throat","swollen lymph nodes near the infection."],"18":["Itching and stinging","Red scaly rash that is shaped like a ring (annular)","Cracking, splitting and peeling in the toe web spaces","Blisters","Yellow or white discoloration of the nails","Bald spots on the scalp."],"19":["A small, raised bump may appear on the skin.","The average size can range from one to 10 millimetres.","The wart may have a rough or smooth surface.","Warts can occur singly or in clusters.","In some cases, the wart may itch.","Face, feet, knees and hands are most commonly affected."],"20":["Intense blushing, often for no apparent reason","Sensation of heat in the face","Perspiration."],"21":["The skin on the shins is most commonly affected.","Other areas that may be affected include the ankles, calves, thighs, buttocks and arms.","Raised red, hard, hot and painful lumps appear on the skin.","The lumps can be from 1 cm to 20 cm wide.","Up to 50 lumps may develop in the affected area.","Legs may swell.","Fever and general malaise may occur.","Around half of all cases are associated with joint pains, particularly the knees.","Conjunctivitis sometimes develops.","The lumps turn from bright cherry red to purple over a few days.","The purple lumps become brownish-yellow and flat over a few weeks.","The lumps tend to recur if the person doesn't have sufficient rest."],"22":["sensory nerve damage – when the sensory nerves are damaged, they cannot register pain. This leaves the extremities of hands and feet vulnerable to burns and injuries that can result in loss of fingers, toes, hands and feet","eye nerve damage – when the eye is affected, it can lead to blindness, particularly if the person does not know how to prevent injury due to dust or other irritants","motor nerve damage – when the motor nerves are involved, various forms of paralysis can occur such as ‘dropped foot’, ‘dropped wrist’, ‘clawed hand’, or lagophthalmos (where the eye cannot close)","autonomic nerve damage – the autonomic nerves regulate the PNS body functions, such as blood pressure, heart rate, sweating, bowel and bladder emptying, and digestion. Damage to the autonomic nerves can cause hair loss and can affect the ability to sweat, leaving the skin dry and cracked and exposed to secondary infection."],"23":["enlarged capillaries (telangiectasis)","a permanent flush across the nose and cheeks","yellow-headed pimples on the forehead, cheeks and chin","non-tender lumps under the skin","mildly swollen cheeks and nose (hyperplasia)","frequent blushing","a sensation of burning or stinging","a rash that is confined to the face."],"24":["thickening and hardening of the skin","Raynaud's phenomenon – a condition which affects the blood flow to the extremities, most often fingers and toes. It is caused by a sudden constriction of the blood vessels","stiffness and pain in the muscles or joints (or both)","indigestion, heartburn, diarrhoea, constipation."]}}